
"""
За основу взятий код LarsKort
"""

while True:
    name = input()
    # Словник
    slovn = {
            'a':'а',
            'b':'б',
            'v':'в',
            'g':'г',
            'd':'д',
            'e':'е',
            'yo':'є',
        'zh':'ж',
        'z':'з',
        'i':'і',
        'k':'к',
        'l':'л',
        'm':'м',
        'n':'н',
        'o':'о',
        'p':'п',
        'r':'р',
        'j':'дж',
        's':'с',
        't':'т',
        'u':'у',
        'f':'ф',
        'h':'х',
        'c':'ц',
        'ch':'ч',
        'sh':'ш',
        'sch':'щ',
        'y':'и',
        'e':'е',
        'ya':'я',
        'A':'А',
        'B':'Б',
        'V':'В',
        'G':'Г',
        'D':'Д',
        'E':'Е',
        'ZH':'Ж',
        'Z':'З',
        'I':'І',
        'J':'Дж',
        'K':'К',
        'L':'Л',
        'M':'М',
        'N':'Н',
        'O':'О',
        'P':'П',
        'R':'Р',
        'S':'С',
        'T':'Т',
        'U':'У',
        'F':'Ф',
        'H':'Х',
        'C':'С',
        'CH':'Ч',
        'SH':'Ш',
        'SCH':'Щ', 
        'Y':'Й',
        'E':'Е',
        'U':'Ю',
        'YA':'Я'
        }
            
    # заміна
    for key in slovn:
        name = name.replace(key, slovn[key])

    print (name)
